export interface NewsArticle {
    thumbnail: string;
    category:　`お知らせ` | `重大`;
    date: string;
    title: string;
    explanation: string;
}

export const newsArticles: NewsArticle[] = [
    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月27日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },
    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月26日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },
    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月25日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月24日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },
    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月23日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },
    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月22日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },
    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月21日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },
    {
        thumbnail: `/thumbnail.jpg`,
        category: `お知らせ`,
        date: `令和8年3月20日`,
        title: `最新情報のテスト`,
        explanation: `ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力ここに説明を入力`
    },
]